# GetImage Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..GetImage Method
FabricationServiceButton Class See Also
---
Gets the image for fabrication service button.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public virtual Bitmap GetImage()
```

Visual Basic
---
```text
Public Overridable Function GetImage As Bitmap
```

Visual C++
---
```text
public:
virtual Bitmap^ GetImage()
```

# ### Return Value
System.Drawing.Bitmap represents the fabrication service button image. nullNothingnullptra null reference (Nothing in Visual Basic) if there is no preview image.
# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace